{
  "series": [
    {
      "id": 1,
      "title": "Prepared for His Return",
      "messages": [
        {
          "id": 1,
          "author": "Edem Ameyou",
          "title": "RENEW YOUR MIND, FOR THE TIME IS AT HAND",
          "content": "My kingdom is not of this world. If it were, my servants would fight to prevent my arrest by the Jewish leaders. But now my kingdom is from another place   (John 18-36-NIV).  Jesus has finished  the  work the Father has given Him to do. He was about to accomplish the ultimate sacrifice for the redemption of Mankind. After praying in the garden of Gethsemane, He was arrested, and tried before  the Sanhedrin, condemned and sent to Pilate the next morning (Mark 14:53-65). Before Pilate, when Jesus was questioned about His kingship, He  gave the following answer: - My kingdom is not of this world. If it were, my servants would fight to prevent my arrest by the Jewish leaders. But now my kingdom is from another place ( John 18-36-NIV). The concern of the people living in the time of Jesus was wellbeing, prosperity, peace and happiness on this earth. As disciples of Jesus-Christ awaiting His kingdom of righteousness, should our hope rest on this world? Jesus made it clear, His kingdom was not of this earth. His mission was the establishment of  His kingdom of righteousness where sin  will not longer be named the second time; a kingdom of godliness were true love and the perfect peace and rest of God will abide forever. Today we are so much privileged to witness  the fulfillment of the final events prophecies in the religious, political, natural, and economical worlds; things Holy Spirit filled apostles of Jesus-Christ wished to see in their lifetime.  In Luke 21:29-39-KJV we see the words of  Jesus Christ regarding the final events preceding His return: - when these things begin to come to pass, then look up, and lift up your heads; for your redemption draweth nigh.  And he spake to them a parable; Behold the fig tree, and all the trees;  When they now shoot forth, ye see and know of your own selves that summer is now nigh at hand. So likewise ye, when ye see these things come to pass, know ye that the kingdom of God is nigh at hand.  Verily I say unto you, this generation shall not pass away, till all be fulfilled. Heaven and earth shall pass away: but my words shall not pass away. And take heed to yourselves, lest at any time your hearts be overcharged with surfeiting, and drunkenness, and cares of this life, and so that day come upon you unawares. For as a snare shall it come on all them that dwell on the face of the whole earth. Watch ye therefore, and pray always, that ye may be accounted worthy to escape all these things that shall come to pass, and to stand before the Son of man. In the verses above Jesus spelled out the things that can prevent us today to have a spiritual focus, and a meaningful relationship with God: -  surfeiting  (overindulgence in worldly things, seeking for worldly things in excess), -  Drunkenness (carelessness regarding the things of God, being totally lost in the things of this world), -  the cares of this life (the concern about worldly things, careers, money, fame, worldly ambitions, , houses, success, positions, and the likes). As we begin the journey in this new year, our  prayer  for you and ourselves is not to be conformed to this world but, to be transformed by the renewing of our mind, that we may prove what is good, acceptable and the perfect will of God, (Romans 12:2) especially in this time. We pray for God to bless you as you get very intentional  in making God and His soon coming kingdom your priority. By His grace, we will see His face, not in shame but in righteousness. Amen. "
        },
        {
          "id": 2,
          "author": "Edem Ameyou",
          "title": "LOVE A COMMAND? HOW CAN? ",
          "content": "'A new command I give you: Love one another. As I have loved you, so you must love one another'.(John 13:34)  Before the fall, there was unity, love and perfect harmony in the garden of Eden. Adam and Eve knew nothing else than God´s perfect love. But right after the fall, the very first words that came from the mouth of the first couple were words of  accusations, confusion, regret, anger and fear; why? Because the first consequences of sin on their lives affected their emotions, which once pure, were now messed up; true love in the Holy Ghost was gone. As difficult as this  could possibly sound, the love of God is not controlled by our fluctuating emotional situations; the sinner naturally loves in a moment, and hate the next; our confused emotions are not  safe grounds we can stand on to develop a godly character; Eve proved this when she was led away from God by her emotions; Adam  proved this when he began blaming his wife. It is quite interesting that when God wants to do a work of restoration in the life of a believer, He works in the  emotions. Since there has been displacement of feelings and confusion in emotions, God then uses our difficult emotional circumstances to  produce and develop in us the fruits of the Holy Spirit, or fruits of His love. Why should God´s love be a command? Because God´s love is the response of a surrendered heart to His ordinances; God´s love proceeds from a heart that denies self for the good of a fellowman in need. God´s love is found in the life of Jesus. The love of Jesus was rooted in His will to obey His Father; in Psalm 40:8, the words of Jesus were as follows: “I delight to do Your will, O my God, And Your law is within my heart”. When Jesus saw us in our sufferings, He was not moved by feelings to  save His life; but instead, He worked for our highest good without regard to His own life. This type of love when we have it, will give us victory over self: “Son though He was, He learned obedience from what He suffered and, once made perfect, He became the source of eternal salvation for all who obey Him (Hebrews 5:8-9)”  Friends, do you love God only when you feel like loving Him? Or do you understand how much God loved you through Jesus? May God fill our heart with the selfless love of Calvary; may God establish His holy love in our heart; may God´s love be rooted in our  will to obey the Savior no matter the cause; may we delight in doing God´s will.   When He comes, we will  see His face not in shame, but in the beauty of love and holiness. "
        },
        {
          "id": 3,
          "author": "Edem Ameyou",
          "title": "WATCH AND PRAY TO BE SEALED ",
          "content": "Be always on the watch, and pray that you may be able to escape all that is about to happen, and that you may be able to stand before the Son of Man. (Luke 21:36)  As we have seen in the previous message, Jesus mentioned three things that could negatively affect our spiritual life and prevent us to watch and pray.  - surfeiting  (overindulgence in worldly things, seeking for worldly things in excess), -  Drunkenness (carelessness regarding the things of God, being totally lost in the things of this world), -  the cares of this life (the concern about worldly things, career, money, fame, worldly ambitions,  houses, success, positions, and the likes). If these things do not overshadow us, we will have the moral predisposition to spend time with God through study and prayer for the purpose of settling in the Truth both intellectually and spiritually (SDA Bible Commentary Vol 4 p1161), and knowing God experientially to naturally  trust and obey Him.  By beholding Jesus daily through spending time with Him, we will be changed in His image,  so we might bear His likeness in character (The Review and Herald, May 21, 1895). 7BC 970.3),  retain that image in us (The Signs of the Times, July 18, 1911, 7BC 970.4), and ultimately be sealed by the Holy Spirit  for the day of redemption (Ephesians 4:30).  That sealing is the escape that will keep Christians safe in times of trouble and allow them to stand before Jesus blameless at His son return.  Like the early Christians had the small city of Pella provided as a refuge, before the destruction of Jerusalem, like the Israelites had time to sprinkle the bloodmark, ensuring their safety before Egyptians first-born were slain,  God will seal and shield  those who have Christ living in them before the final destruction that are to come on the earth through the  final plagues. Christ in us is the only hope to see His face in glory when He returns Are you taking  time today through prayer and Bible study for Christ to be formed inside of you? Our prayer for you is to be intentional, for God to seal you for glory. By His grace, we will see His face, not in shame but in righteousness. Amen "
        },
        {
          "id": 4,
          "author": "Edem Ameyou",
          "title": "WHAT SERMON ARE YOU PREACHING? ",
          "content": "“With man this is impossible, but with God all things are possible.” (Luke 21:36)  In Luke 18, Jesus gave the parable of the persistent widow, and the parable of the tax collector; then He took the little children to teach the disciples. At that moment in time, a young rich ruler came to Him asking what He should  do to have eternal life. Jesus told Him to sell his belongings, to give the money to the poor, then to come and follow Him. This was quite a challenging situation for the young rich man. After these events,  the Lord Jesus-Christ made the following statement: - What is not possible to man is possible to God (Luke 18:27).  What is it that is so difficult to man, but possible to God? Man is naturally proud, self-centered, self-seeking. It is so difficult for man to deny self. But to God, self-denial is possible. The four object lessons Jesus gave in Luke 18 were meant to teach disciples this lesson of self-denial. Some lessons preceding the cross Lesson to learn The parable of the persistent widow Self-denial The parable of the tax collector Self-denial Illustration with the little children Self-denial The young rich ruler and the Kingdom Self-denial  In fact, the Bible said, after all these events, Jesus predicted His death for His disciples for the third time; yet their mind was  still not opened to the lesson they were been taught. Then came the day Jesus was arrested; the disciples fled. At the cross, through His self-denial, Jesus-Christ made a public display of God´s love to the universe. The cross was meant to first destroy the pride and selfishness of the disciples, so the love of God might finally move into their humbled and surrendered hearts. Through the death of Christ at Calvary, the disciples understood the word: - 'Whoever wants to be my disciple must deny themselves and take up their cross and follow me. (Matthew 16:24). The cross of Christ, and the power of the resurrection that followed were the historical events which drastically subdued the ego of the followers of Christ, and prepared them for the outpouring of the Holy Spirit on the Day of Pentecost.  “The same work, only in greater degree, must be done (Ellen White -TM- 507)” ,not tomorrow but now. Dear reader, what sermon are you preaching? Pride, Selfishness? “The most difficult sermon to preach and the hardest to practice is self-denial – (E.G. White'. Advent Review and Sabbath Herald-1907). If we want to be filled with the Holy Spirit, and work for God effectively, we are to have the Spirit of self-denial Jesus had; and demonstrate the total surrender Jesus showed on the cross. That is the only one condition. Do you want to be filled with the Holy Spirit? Learn from the Master. He is the Lamb of God. You too can preach the most difficult sermon. May God help us to be humble, so that when Jesus comes, we might not hide from Him, but behold the face of the Lamb of God in His beauty and righteousness. "
        }
      ]
    },
    {
      "id": 2,
      "title": "Walking with God",
      "messages": []
    }
  ]
}
